app/controllers/events_controller.rb

  def index
    res = {}
    user = User.find(params[:user_id])

    # events_admin = user.events.to_a.keep_if { |event| event.time > Time.now }.sort!
    # events_pending = Invitation.where(invitee_id: user.id).where(status: 2).map { |invite| Event.find(invite.event_id) }
    # events_attending = Invitation.where(invitee_id: user.id).where(status: 1).map { |invite| Event.find(invite.event_id) }

    # res[:events] = events_admin
    # res[:events_pending] = events_pending
    # res[:events_attending] = events_attending
    if params[:option] == 'time'
      render json: Event.find_by_sql('SELECT * FROM events WHERE time > NOW() ORDER BY time - NOW()'), status: :ok
    elsif params[:option] == 'all'
      render json: Event.all, status: :ok
---
SELECT "events".* FROM "events"