app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "andreacab"], ["email", "andrea.cabralb@gmail.com"], ["created_at", "2015-09-08 18:43:33.608863"], ["updated_at", "2015-09-08 18:43:33.608863"]]